dev/app/Models/UserManagement/Organisation.php

select `slack_integrations`.*, `organisation_slack_intergration`.`organisation_id` as `pivot_organisation_id`, `organisation_slack_intergration`.`slack_integration_id` as `pivot_slack_integration_id` from `slack_integrations` inner join `organisation_slack_intergration` on `slack_integrations`.`id` = `organisation_slack_intergration`.`slack_integration_id` where `organisation_slack_intergration`.`organisation_id` = '3' and `field` = 'channel' limit 1
---
    public function getSlackChannelAttribute()
    {
        return $this->slackIntegrations()->where("field", '=', 'channel')->first();