dev/app/Http/Requests/TradeScreen/Market/UserMarketRequestRequest.php

    public function rules()
    {
        //fly selected, outright -> force yes
        //efp switch, risky, caly,options swicth, ->no force select


       $this->tradeStructure = TradeStructure::where('title',$this->input('trade_structure'))->with(['tradeStructureGroups'=>function($q){
            $q->where("trade_structure_group_type_id",1)
                ->with('items.itemType');
           }])->first();
---
select * from `item_types` where `item_types`.`id` in ('1', '2')
select * from `items` where `items`.`trade_structure_group_id` in ('1')
select * from `trade_structure_groups` where `trade_structure_groups`.`trade_structure_id` in ('1')
select * from `trade_structures` where `title` = 'Outright' limit 1