dev/app/Policies/UserMarketPolicy.php

    public function updateNegotiation(User $user, UserMarket $userMarket)
    {
        return $userMarket->marketNegotiations()->where(function($query) use ($user)
        {
            $query->whereHas('user',function($query) use ($user){
                $query->where('organisation_id', $user->organisation_id);
            });
        })->exists() && !$userMarket->userMarketRequest->chosenUserMarket()->exists();
---
select * from `user_market_requests` where `user_market_requests`.`id` = '4' limit 1
select exists(select * from `market_negotiations` where `market_negotiations`.`user_market_id` = '5' and `market_negotiations`.`user_market_id` is not null and (exists (select * from `users` where `market_negotiations`.`user_id` = `users`.`id` and `organisation_id` = '1'))) as `exists`
select exists(select * from `user_markets` where `user_markets`.`id` = '5' and `user_markets`.`deleted_at` is null) as `exists`