dev/app/Policies/UserMarketRequestPolicy.php

select exists(select * from `user_markets` where `user_markets`.`user_market_request_id` = '6' and `user_markets`.`user_market_request_id` is not null and exists (select * from `users` where `user_markets`.`user_id` = `users`.`id` and `organisation_id` = '1') and `user_markets`.`deleted_at` is null order by `updated_at` desc) as `exists`
---
    public function addQoute(User $user, UserMarketRequest $userMarketRequest)
    {
        return !$userMarketRequest->userMarkets()->whereHas('user',function($query) use ($user){
                $query->where('organisation_id',$user->organisation_id);
            })->exists();