dev/app/Rules/CheckActiveUser.php

select * from `users` where `email` = 'xbauch@example.net' limit 1
---
    public function passes($attribute, $value)
    {
        $user = User::where('email', $value)->first();