dev/app/Rules/LevelsImprovement.php

select * from `user_market_requests` where `user_market_requests`.`id` in ('5')
---
    public function passes($attribute, $value)
    {

        $inverse = ($attribute == 'bid' ? 'offer' : 'bid');

        if(!in_array($attribute, ['bid', 'offer'])) {
            return false;
        }
        $this->request->user_market->load('userMarketRequest');