dev/app/Http/Controllers/TradeScreen/MarketRequest/UserMarketController.php

select * from `users` where `users`.`id` = '3' limit 1
---
                $success = $userMarket->repeatQuote($request->user());
            }else
            {
                $success = $userMarket->updateQuote($request->user(),$request->all());