dev/app/Http/Controllers/UserController.php

    public function edit(Request $request)
    {
        $user = $request->user();

        switch (\Auth::user()->setRequiredProfileStep()) {
            case 'password':
                return redirect()->route('user.edit_password');
                break;
            case 'email':
                return redirect()->route('email.edit');
                break;
            case 'trade settings':
                return redirect()->route('trade_settings.edit');
                break;
            case 'interest':
                return redirect()->route('interest.edit');
                break;
            case 'profile':
            default:
                break;
        }

        $organisations = Organisation::where('verified',true)
        ->orWhere(function($query) use ($user) {
            $query->whereHas('users',function($query) use ($user){
                $query->where('id',$user->id);
            });
        })
        ->pluck('title','id')
        ->toArray();
---
select `title`, `id` from `organisations` where `verified` = '1' or (exists (select * from `users` where `organisations`.`id` = `users`.`organisation_id` and `id` = '29'))