dev/app/Http/Controllers/UserPrefController.php

    public function index()
    {
        $user = Auth::user();
        $userPreferences = [
            "prefered_market_types" => $user->marketInterests()->with('markets')->get()->toArray(),
            "user_name" => $user->full_name
        ];
---
select * from `markets` where `markets`.`market_type_id` in ('1')
select `market_types`.*, `user_market_interests`.`user_id` as `pivot_user_id`, `user_market_interests`.`market_type_id` as `pivot_market_type_id` from `market_types` inner join `user_market_interests` on `market_types`.`id` = `user_market_interests`.`market_type_id` where `user_market_interests`.`user_id` = '3'

    public function update(Request $request, $id)
    {
        Auth::user()->marketInterests()->attach($id);
        $prefered_market_type = Auth::user()->marketInterests()->where('market_type_id','=',$id)->with('markets')->first();
---
insert into `user_market_interests` (`market_type_id`, `user_id`) values ('1', '9')
select * from `markets` where `markets`.`market_type_id` in ('1')