dev/app/Models/Market/UserMarket.php

select * from `users` where `users`.`id` = '29' limit 1
---
    public static function placeOldQuotesOnHold()
    {
        //get all the user market that have no chosen market on market request the last 20 min
        $date = Carbon::now()->subMinutes(config('marketmartial.auto_on_hold_minutes'),20);
        $updatedMarketsId = self::where('created_at','<=',$date)
        ->where('is_on_hold',false)
        ->whereDoesntHave('marketNegotiations',function($q){
            $q->where('is_accepted',true);
        })
        ->doesntHave('userMarketRequest.chosenUserMarket')
        ->pluck('id');

        if(count($updatedMarketsId) > 0)
        {
            self::whereIn('id',$updatedMarketsId)->update(['is_on_hold' => true]);
            self::whereIn('id',$updatedMarketsId)->each(function ($userMarket, $key) {
                $organisation = $userMarket->user->organisation;
                $userMarket->fresh()->userMarketRequest->notifyRequested([$organisation]);
            });