dev/app/Models/Market/UserMarket.php

    public function accept()
    {
        $marketRequest = $this->userMarketRequest;
        $marketRequest->chosenUserMarket()->associate($this);
        return $marketRequest->save();
---
update `user_market_requests` set `chosen_user_market_id` = '5', `updated_at` = '2018-09-25 12:25:59' where `id` = '4'

    public function addNegotiation($user,$data)
    {


            $marketNegotiation = new MarketNegotiation($data);
            $marketNegotiation->user_id = $user->id;

            $counterNegotiation = $this->marketNegotiations()
                                            ->findcounterNegotiation($user)
                                            ->first();


            if($this->userMarketRequest->getStatus($user->organisation_id) == "negotiation-open")
            {
                $counterNegotiation = $counterNegotiation->getImprovedNegotiation($marketNegotiation);
            }


            if($counterNegotiation)
            {
                $marketNegotiation->market_negotiation_id = $counterNegotiation->id;
                $marketNegotiation->counter_user_id = $counterNegotiation->user_id;
            }

            try {
                 DB::beginTransaction();

                $this->marketNegotiations()->save($marketNegotiation);
                $this->current_market_negotiation_id = $marketNegotiation->id;
                $this->save();
---
select * from `market_negotiations` where `market_negotiations`.`user_market_id` = '6' and `market_negotiations`.`user_market_id` is not null and exists (select * from `users` where `market_negotiations`.`user_id` = `users`.`id` and `id` != '3') order by `created_at` desc limit 1
insert into `market_negotiations` (`bid`, `offer`, `bid_qty`, `offer_qty`, `is_repeat`, `has_premium_calc`, `bid_premium`, `offer_premium`, `is_private`, `cond_is_repeat_atw`, `cond_fok_apply_bid`, `cond_fok_spin`, `cond_timeout`, `cond_is_subject`, `cond_buy_mid`, `cond_buy_best`, `user_id`, `market_negotiation_id`, `counter_user_id`, `user_market_id`, `updated_at`, `created_at`) values ('109', '20311', '500', '500', '0', '0', '', '', '0', '', '', '', '', '', '', '', '3', '8', '29', '6', '2018-09-25 10:41:35', '2018-09-25 10:41:35')
update `user_markets` set `current_market_negotiation_id` = '11', `updated_at` = '2018-09-25 10:41:35' where `id` = '6'

    public function isMaker($user = null) {
        $org = ($user == null ? $this->resolveOrganisationId() : $user->organisation_id);
        if($org == null) {
            return false;
        }
        if($this->makerMarketNegotiation == null) {
            return $org == $this->firstNegotiation->user->organisation_id;
---
select * from `users` where `users`.`id` = '29' limit 1

    public function preFormattedMarket()
    {
        $is_maker = $this->isMaker();
        $is_interest = $this->isInterest();

        $uneditedmarketNegotiations = $marketNegotiations = $this->marketNegotiations()->with('user')->get();
---
select * from `market_negotiations` where `market_negotiations`.`user_market_id` = '6' and `market_negotiations`.`user_market_id` is not null
select * from `users` where `users`.`id` in ('3', '29')