dev/app/Models/Market/UserMarket.php

    public function isBestQuote()
    {
        /*
        * Handle VOL Spread - only when there DOESN'T exist a better(lower) VOL Spread
        */
        if($this->firstNegotiation->offer != null && $this->firstNegotiation->bid != null) {
            $vol = ($this->firstNegotiation->offer-$this->firstNegotiation->bid);
            $id = $this->id;
            return $this->userMarketRequest()
                ->whereHas('userMarkets', function($sub) use ($id, $vol) {
                    $sub->where('id', '!=', $id);
                    $sub->whereHas('marketNegotiations', function($q) use ($vol) {
                        $q->whereRaw('(offer-bid) < ?', [$vol]);
                    });
                })
                ->doesntExist();
        }
        /*
        * Handle BID/OFFER ONLY - only when there DOESN'T exist a better(bid:higher|offer:lower) bid/offer
        */
        $attr = $this->firstNegotiation->bid != null ? 'bid' : 'offer'; // has to be one of them
        $level = $this->firstNegotiation->{$attr};
        $id = $this->id;
        return $this->userMarketRequest()
            ->whereHas('userMarkets', function($sub) use ($id, $attr, $level) {
                $sub->where('id', '!=', $id);
                $sub->whereHas('firstNegotiation', function($q) use ($attr, $level) {
                    $symbol = ( $attr == 'bid' ? '>' : '<' );
                    $inverse = ( $attr == 'bid' ? 'offer' : 'bid' );
                    $q->where($attr, $symbol, $level);
                    $q->whereNull($inverse);
                });
            })
            ->doesntExist();
---
select * from `users` where `users`.`id` = '29' limit 1

    public static function placeOldQuotesOnHold()
    {
        //get all the user market that have no chosen market on market request the last 20 min
        $date = Carbon::now()->subMinutes(config('marketmartial.auto_on_hold_minutes',20));
        $updatedMarketsId = self::where('created_at','<=',$date)
        ->where('is_on_hold',false)
        ->whereDoesntHave('marketNegotiations',function($q){
            $q->where('is_accepted',true);
        })
        ->doesntHave('userMarketRequest.chosenUserMarket')
        ->pluck('id');

        if(count($updatedMarketsId) > 0)
        {
            self::whereIn('id',$updatedMarketsId)->update(['is_on_hold' => true]);
            self::whereIn('id',$updatedMarketsId)->each(function ($userMarket, $key) {
                $organisation = $userMarket->user->organisation;
                $userMarket->fresh()->userMarketRequest->notifyRequested([$organisation]);
            });
---
select * from `market_negotiations` where `market_negotiations`.`id` = '11' limit 1