dev/app/Models/MarketRequest/UserMarketRequest.php


        }else
        {
            $data["quotes"]            =    $this->userMarkets()->when(!$is_interest, function($query) use ($current_org_id) {
                                                $query->where(function($query) use ($current_org_id) {
                                                    // Only publicly visible
                                                    $query->whereHas('currentMarketNegotiation', function($q) {
                                                        $q->where('is_private', false);
                                                    });
                                                    // Or this org is the interest
                                                    $query->orWhereHas('user',function($q) use ($current_org_id) {
                                                        $q->where('organisation_id',$current_org_id);
                                                    });
                                                });
                                            })->get()->map(function($item) {
                                                return $item->setOrgContext($this->resolveOrganisation())->preFormattedQuote();
                                            });
---
select * from `market_negotiations` where `market_negotiations`.`user_market_id` = '5' and `market_negotiations`.`user_market_id` is not null order by `created_at` desc, `id` desc limit 1