dev/app/Models/MarketRequest/UserMarketRequest.php

    public function preFormatted()
    {
        $current_org_id =  $this->resolveOrganisationId();

        $interest_org_id = $this->user->organisation_id;
        $is_interest = $interest_org_id == $current_org_id && $current_org_id != null;

        $data = [
            "id"                => $this->id,
            "market_id"         => $this->market_id,
            'is_interest'       => $is_interest,
            "is_market_maker"   => false,
            "trade_structure"   => $this->tradeStructure->title,
            "trade_items"       => $this->userMarketRequestGroups
             ->keyBy('tradeStructureGroup.title')
             ->map(function($group) {
                $data = $group->userMarketRequestItems->keyBy('title')->map(function($item) {
                    if($item->type == 'expiration date') {
                        return (new \Carbon\Carbon($item->value))->format("My");
                    }
                    return $item->value;
                });
                $data['id'] = $group->id;
                $data['choice'] = $group->is_selected;
                if($group->tradable) {
                    $data['tradable'] = $group->tradable->preFormatted();
                }
                return $data;
            }),
---
select * from `user_markets` where `user_markets`.`user_market_request_id` = '4' and `user_markets`.`user_market_request_id` is not null and `user_markets`.`deleted_at` is null order by `updated_at` desc
select * from `user_markets` where `user_markets`.`user_market_request_id` = '6' and `user_markets`.`user_market_request_id` is not null and `user_markets`.`deleted_at` is null order by `updated_at` desc

    public function canNegotiate($current_org_id)
    {

        $interest_org_id = $this->user->organisation->id;
        if($this->chosenUserMarket != null)
        {
            $marketCount = $this->chosenUserMarket->marketNegotiations()->count();
            if($marketCount == 1)
            {
                return $interest_org_id == $current_org_id;
            }else
            {
                 $lastNegotiation = $this->chosenUserMarket->lastNegotiation;
                  return $this->chosenUserMarket->marketNegotiations()
                                ->lastNegotiation()
                                ->where(function($q) use ($current_org_id){
                                        $q->organisationInvolved($current_org_id);
                                        // $q->orWhere(function($q) use ($current_org_id){
                                        //     $q->whereHas('marketNegotiationParent',function($q) use ($current_org_id) {
                                        //         $q->organisationInvolved($current_org_id);
                                        //     });
                                        // });

                                    $q->organisationInvolvedOrCounters($current_org_id);
                    })->where('market_negotiations.id',$lastNegotiation->id)->exists();
---
select exists(select * from `user_markets` where `user_markets`.`id` is null and `user_markets`.`deleted_at` is null) as `exists`