dev/app/Http/Controllers/TradeScreen/MarketTypeController.php

    public function index()
    {
        return MarketType::with('markets')->get();
---
select * from `market_types`
select * from `markets` where `markets`.`market_type_id` in ('1', '2', '3')