dev/app/Http/Controllers/TradeScreen/MarketUserMarketReqeustController.php

select * from `trade_structure_groups` where `trade_structure_groups`.`id` in ('1')
select * from `trade_structures` where `trade_structures`.`id` in ('1')
select * from `user_market_request_groups` where `user_market_request_groups`.`user_market_request_id` in ('1', '4', '5')
select * from `user_market_request_items` where `user_market_request_items`.`user_market_request_group_id` in ('1', '4', '5')
select * from `organisations` where `organisations`.`id` = '3' limit 1
---
    public function index(Request $request,Market $market)
    {
        $userMarketRequests = $market->userMarketRequests()
            ->active()
            ->with([
                'tradeStructure',
                'userMarketRequestGroups',
                'userMarketRequestGroups.tradeStructureGroup' =>function($q){
                    $q->where("trade_structure_group_type_id",1)
                    ->with('items');
                },
                'userMarketRequestGroups.userMarketRequestItems'
            ])->get();


        $user = $request->user();

        $output = $userMarketRequests->map(function($marketRequest) use ($user) {
            return $marketRequest->setOrgContext($user->organisation)->preFormatted();
        });

select * from `items` where `items`.`trade_structure_group_id` in ('1')
select * from `trade_structure_groups` where `trade_structure_groups`.`trade_structure_id` in ('1')
select * from `trade_structures` where `title` = 'Outright' limit 1
insert into `user_market_requests` (`trade_structure_id`, `user_market_request_statuses_id`, `market_id`, `chosen_user_market_id`, `user_id`, `updated_at`, `created_at`) values ('1', '1', '2', '', '34', '2018-09-25 11:41:33', '2018-09-25 11:41:33')
---
    public function store(UserMarketRequestRequest $request, Market $market)
    {
        $this->authorize('addMarketReqeust',$market);
        $input = $request->all();

        $tradeStructure = TradeStructure::where('title',$request->input('trade_structure'))->with(['tradeStructureGroups' => function($q){
            $q->where("trade_structure_group_type_id",1)
            ->with('items');
        }]
        )->firstOrFail();

        $inputTradeStructureGroups = $request->input('trade_structure_groups');

        $responseData = [
            "trade_structure"   => $tradeStructure->title,
            "trade_items"       => []
        ];

        try {
            DB::beginTransaction();

            $userMarketRequest = new UserMarketRequest([
                "trade_structure_id"                => $tradeStructure->id,
                "market_id"                         => $market->id,
                "chosen_user_market_id"             => null
            ]);


            $userMarketRequest->user_id = $request->user()->id;
            $userMarketRequest->save();