dev/app/Http/Controllers/TradeScreen/MarketTypeMarketController.php

    public function index(MarketType $marketType)
    {
        return $marketType->markets()->where('parent_id', NULL)->with('children')->get();
---
select * from `markets` where `markets`.`market_type_id` = '1' and `markets`.`market_type_id` is not null and `parent_id` is null