dev/app/Http/Controllers/TradeScreen/MarketType/TradeStructureController.php

   	public function index(MarketType $marketType)
   	{
      return response()->json([
            'data'=> $marketType->tradeStructures()->with('tradeStructureGroups.items')->get(),
            'message'=>"Trade Structures loaded successfully.",
        ]);
---
select * from `items` where `items`.`trade_structure_group_id` in ('1', '2', '3', '4', '5', '6', '7', '8', '9', '10')
select * from `trade_structure_groups` where `trade_structure_groups`.`trade_structure_id` in ('1', '2', '3', '4', '5')
select `trade_structures`.*, `market_types_trade_structures`.`market_type_id` as `pivot_market_type_id`, `market_types_trade_structures`.`trade_structure_id` as `pivot_trade_structure_id` from `trade_structures` inner join `market_types_trade_structures` on `trade_structures`.`id` = `market_types_trade_structures`.`trade_structure_id` where `market_types_trade_structures`.`market_type_id` = '1'